; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v7 - type_1 ?v1 - type_2)
 	      (pred_3 ?v4 - object ?v1 - type_2)
	      (pred_2 ?v7 - type_1 ?v8 - type_3)
	      (pred_4 ?v7 - type_1 ?v4 - object ?v8 - type_3))

   (:action op_1
       :parameters  (?v7 - type_1 ?v5 ?v3 - type_2)
       :precondition (and  (pred_1 ?v7 ?v5))
       :effect (and  (pred_1 ?v7 ?v3)
		     (not (pred_1 ?v7 ?v5))))

   (:action op_2
       :parameters (?v7 - type_1 ?v2 - object ?v6 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_3 ?v2 ?v6) (pred_1 ?v7 ?v6) (pred_2 ?v7 ?v8))
       :effect (and (pred_4 ?v7 ?v2 ?v8)
		    (not (pred_3 ?v2 ?v6)) 
		    (not (pred_2 ?v7 ?v8))))

   (:action op_3
       :parameters (?v7 - type_1 ?v2 - object ?v6 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v7 ?v2 ?v8) (pred_1 ?v7 ?v6))
       :effect (and (pred_3 ?v2 ?v6)
		    (pred_2 ?v7 ?v8)
		    (not (pred_4 ?v7 ?v2 ?v8)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_05 - type_1
obj_03 obj_09 - type_3
obj_02 obj_01 obj_06 - type_2
obj_07 obj_08 obj_04 - object)
(:init
(pred_1 obj_05 obj_06)
(pred_2 obj_05 obj_03)
(pred_2 obj_05 obj_09)
(pred_3 obj_07 obj_06)
(pred_3 obj_08 obj_06)
(pred_3 obj_04 obj_01)
)
(:goal
(and
(pred_3 obj_07 obj_06)
(pred_3 obj_08 obj_06)
(pred_3 obj_04 obj_06)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_05 ?b obj_09))))
)
)

; plan
1. (op_1 obj_05 obj_06 obj_01)
   deleted: (pred_1 obj_05 obj_06)
   added: (pred_1 obj_05 obj_01)
   goals met: 2 of 3
2. (op_2 obj_05 obj_04 obj_01 obj_03)
   deleted: (pred_3 obj_04 obj_01) (pred_2 obj_05 obj_03)
   added: (pred_4 obj_05 obj_04 obj_03)
   goals met: 2 of 3
3. (op_1 obj_05 obj_01 obj_06)
   deleted: (pred_1 obj_05 obj_01)
   added: (pred_1 obj_05 obj_06)
   goals met: 2 of 3
4. (op_3 obj_05 obj_04 obj_06 obj_03)
   deleted: (pred_4 obj_05 obj_04 obj_03)
   added: (pred_3 obj_04 obj_06) (pred_2 obj_05 obj_03)
   goals met: 3 of 3
